[[5], [6, "I would analyze which design pattern matches users' needs when using a smartphone, using properties that are unique to a smartphone environment. One characteristic that the digital tool has is using algorithm to make proper pairs. For that reason, I would choose to use the \"Max-welfare\" pattern over the \"stable-pairing\" pattern.", "As both these design patterns have certain learning benefits, I would decide to use Max-welfare because it allows students to choose whether they want to be paired with the same person or not. If they want to be paired with the same person, then they are actually using the stable-pairing design pattern.", "I would choose a design pattern that could yield the most gains for learners over the course of their study. Max-welfare design pattern seems to be most aligned with this goal. But most practically, I would suggest moving with stable-pairing first.", "Max-welfare. Because mobile app makes it easier to communicate with different people anytime and anywhere. It also costs less to find a new teammate. It can also use computer-determined methods to find the best pairing.", "Since design patterns don't provide a principle to guide us choosing better practices, I suggest trying the easier pattern to implement first (e.g. stable-pairing), then move to max-welfare if results are inadequate", "Since the max welfare design pattern suggests that learners be paired for peer-tutoring over multiple sessions so that they gain the maximum from each other in that session, it would be more optimal.", "Max-welfare, because people are flowing fast, you cannot tell who will still be here tomorrow, so it's hard to form stable patterns. Rather, pair people with max gain will be more beneficial.", "If we want the learner to have the max learning gain, then it's better to use \"Max-welfare\" because learners can experience diverse experience and empathy.", "Choose the max-welfare pattern because max-welfare would choose the stable-matching pairing if that were indeed more optimal。", "Stable pairing can detract from diversity in learning. As such, it is better to opt for the max welfare pattern.", "Since the app allows learners to participate in tutoring over any duration, Max-welfare would be more flexible."]]