[{"Question_type": "SA", "Question_id": 5, "Question_text": "In a math class activity, students are trying to invent the formula to calculate the area of a square while also contrasting it with calculating the area of a rectangle and triangle. Students are given the right answer after the invent and contrast activity. What are the likely benefits student would get out of this activity of inventing and contrasting cases?", "Correct_answer_choice": ["Students will better select the right formula for the problem"], "Choice_A_text": "Students will better select the right formula for the problem", "Students_select_A": 14, "Choice_B_text": "Students will perceive a better learning of the surface area concept", "Students_select_B": 17, "Choice_C_text": "Students will remember the formulas longer than they would with lecture-practice method", "Students_select_C": 20, "Choice_D_text": "Students will perform better in other unrelated math concepts", "Students_select_D": 4}, {"Question_type": "MC", "Question_id": 6, "Question_text": "The “Stable-pairing” design pattern suggests that when learners need to be paired for multiple peer tutoring sessions, for larger learning gains learners overall, they should be paired such that over long periods of time (e.g. a month), they have the same partner. The “Max-welfare” design pattern suggests that when learners need to be paired for peer-tutoring over multiple sessions, for maximizing the learning gain in each session they should be paired with the partner they are most likely to learn from in that session. If you’re designing a peer tutoring iPhone app where learners can participate in tutoring over any duration, how would you decide which pattern to use?", "Correct_answer_choice": ["Conduct a controlled test (or A/B test) to see which pattern yields the best result in our app"], "Choice_A_text": "Conduct a controlled test (or A/B test) to see which pattern yields the best result in our app", "Students_select_A": 13, "Choice_B_text": "Try the easier pattern to implement first (e.g. stable-pairing), then move to max-welfare if results are inadequate", "Students_select_B": 2, "Choice_C_text": "Choose the max-welfare pattern because max-welfare would choose the stable-matching pairing if that were indeed more optimal", "Students_select_C": 9, "Choice_D_text": "Choose the stable-matching pattern because we are trying to optimize for learning over many sessions, not just one particular session", "Students_select_D": 0}]